backup_simulation/case_001/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.25 -0.25 -0.05)
    ( 0.25 -0.25 -0.05)
    ( 0.25  0.25 -0.05)
    (-0.25  0.25 -0.05)
    (-0.25 -0.25  0.55)
    ( 0.25 -0.25  0.55)
    ( 0.25  0.25  0.55)
    (-0.25  0.25  0.55)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (35 35 80) simpleGrading (1 1 1)
);

edges
(
);

boundary 
(
    allBoundary
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
        );
    }

    top 
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
